In [ ]:
x = 5 
y = 10

type(y)

# int - number with no decimals - ages, number of plans, &c
# float - number with a decimal - things like FTE

# mathematical operators work on number tyypes + - / * **
z = x ** y

z

9765625

In [21]:
a = "5"
b = "10"

type(a)

# for strings + concatenates
c = a + b

c

'510'

In [22]:
d = int(a) + int(b)
d

15

In [28]:
name = "will levack-payne"
name.title()
# lots of string methods exist for cleaning

'Will Levack-Payne'

In [ ]:
# Lists
# square brackets, with each element separated by a comma and a space
list_1 = [1, x, a]
list_2 = [10, 11, 12, list_1]
type(list_1)

list_3 = list(range(10))
list_3[:9]

#list_1[start:stop:step]
# start is inclusive
# stop is exclusive
# counting of elements in python starts from 0 from the left
# counting from the right using -1

[0, 1, 2]

In [63]:
# Dictionary 
# Elements separated by commas
# key:value pairs
# keys have to be immutable objects - objects that can't be changed - string or a number
# values - anything
dict_1 = {'Key_1':1, 
          'key_2':2}


ethnicity_dict = {'WIRI':'White',
                  'WOTH':'White',
                  'CHNE':'Chinese'}

ethnicity_dict['CHNE'] # access vlaues from dict

ethnic_items = list(ethnicity_dict.items()) # .keys() .values() to access keys and values, .items() returns pairs

ethnic_items[1][0]

'WOTH'

In [ ]:
import pandas as pd
# reading excels, or csvs to get data in 

# a dictionary of lists, a list of dicitonarys

# dictionary of lists
df_1 = pd.DataFrame({
    'CHILD':['Will', 'Stephen', 'Ramanjit'],
    'Borough':['Norwich', 'Newham', 'Riverview'],
    'Employer':['D2I', 'LIIA', 'LIIA']
})

df_2 = pd.DataFrame([
    {'CHILD':'Will',
     'Borough':'Norwich',
     'Employer':'D2I'},
    {'CHILD':'Stephen',
     'Borough':'Newham',
     'Employer':'LIIA'},
    {'CHILD':'Ramanjit',
     'Borough':'Riverview',
     'Employer':'LIIA'}
])

condition_1  = df_2['Employer'] == 'LIIA'
condition_2 = df_2['Borough'] == 'Riverview'

df_2[condition_1 & condition_2]

# | or

      CHILD    Borough Employer
2  Ramanjit  Riverview     LIIA

In [81]:
url = 'https://raw.githubusercontent.com/data-to-insight/ERN-sessions/refs/heads/main/data/ChildIdentifiers.csv'

child_identifiers = pd.read_csv(url)

child_identifiers

,Unnamed: 0,LAchildID,UPN,FormerUPN,UPNunknown,PersonBirthDate,ExpectedPersonBirthDate,GenderCurrent,PersonDeathDate
0,0,RND000215205141,A850728973744,NaN,NaN,2019-12-06,NaN,1,NaN
1,1,RND000824303014,A141396438491,NaN,NaN,2011-04-27,NaN,9,NaN
2,2,RND000750143123,A929946861554,NaN,NaN,2017-06-06,2019-12-06,1,NaN
3,3,RND000909164501,A612330267292,NaN,NaN,2014-10-03,NaN,0,NaN
4,4,RND000382171815,A604459366806,NaN,NaN,2019-09-25,NaN,2,NaN
...,...,...,...,...,...,...,...,...,...
327,327,RND000112711501,A465246916125,NaN,NaN,2010-07-07,NaN,2,NaN
328,328,RND000513120794,A540014111973,NaN,NaN,2018-08-14,NaN,2,NaN
329,329,RND000541643134,A549582689058,NaN,NaN,2021-12-09,NaN,51,NaN
330,330,RND000404939452,A889492349196,NaN,NaN,2013-07-23,NaN,2,NaN
331,331,RND000589802835,A877624860226,NaN,NaN,2021-10-25,NaN,9,NaN